tutorials/FF/dambreak/interFoam-interFoam/damright/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (4 0 0)
    (4 0 0.1)
    (8 0 0)
    (8 0 0.1)   
    (8 4 0)
    (8 4 0.1)
    (4 4 0)
    (4 4 0.1)
);

blocks
(
    hex (0 2 4 6 1 3 5 7) (46 46 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type patch;
        faces
        (
            (0 1 6 7)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (2 3 4 5)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
