tutorials/FF/dambreak/interFoam-interFoam/damright/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant damright;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              damright-Mesh;
    patches           (leftWall);
    
    readData
    (
      Velocity
      PressureGradient
    );
    
    writeData
    (
    );
  };
};
